Revit 2024 API
MEPNetworkSegmentId Constructor
 Creates a default invalid segment id on the network.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public MEPNetworkSegmentId()
Visual Basic
Public Sub New
Visual C++
public:
MEPNetworkSegmentId()
See Also
MEPNetworkSegmentId Class
MEPNetworkSegmentId Overload
Autodesk.Revit.DB.Analysis Namespace